// /*ниже -30:  “Оставайтесь дома!”;
// от -30 до -10 включительно: “Сегодня холодно”;
// от -10 до +5 включительно: “Не холодно”;
// от +5 до +15 включительно: “Тепло”;
// от +15 до +25 включительно: “Очень тепло”;
// от +25 до +35: “Жарко”;
// выше либо равно +35: “Пекло!”;

// let temperature = 4;

//     if (temperature <-30) {
//         console. log ('оставайтесь дома')
//         }
//     else (-10 >= temperature >=-30) {
//         console. log ('Сегодня холодно')
//         }
//     else (5 >= temperature >-10) {
//         console. log ('Не холодно')
//         }

// 1. Вывести сумму чисел от 1 до N
// 2. Вывести факториал числа N
// 3. Вывести четные и нечетные числа от 1 до 100
// 4. Вывести проверку на простое число
// 5. Вывести таблицу умножения для числа N
// 6. Вывести сумму цифр числа N
// 7. Обратное число
// 8. Количество цифр в числе N
// 9. Проверка палиндрома для числа N
// 10. Сумма квадратов чисел от 1 до N

// 1. Вывести сумму чисел от 1 до N

// let number = 800;
// let summa = 0;
// for (let i = 1; i < number + 1; i++) {
//   summa += i;
// }
// console.log(summa);

// 2. Вывести факториал числа N

// let number = 5;
// let factorial = 1;
// for (let i = 1; i < number + 1; i++) {
//   factorial *= i;
// }
// console.log(factorial);

// 3. Вывести четные и нечетные числа от 1 до 100

// let maxnamber = 15;
// for(let i = 1; i < maxnamber + 1; i++){
//     if(i%2 == 0) {
//         console.log("Чётное число: " + i)
//     }
//     if(i%2!== 0) {
//         console.log("Нечётное число: " + i)
//     }
// }

// 5. Вывести таблицу умножения для числа N

// let multiplier = 5;
// for(let i = 0; i <11; i++){
//     console.log(multiplier + " x " + i + " = " + multiplier*i)
// }

